columns = {
    "rigid_syst_data_w": ["Номер итерации:\ni",
                          "Координата:\nX_i",
                          "Числ. решение:\nV_i",
                          "Числ. решение двойным шагом:\nv_2i",
                          "Разность:\nV_i-V_2i",
                          "Оценка лок погр\n(общая норма):\nОЛП",
                          "Шаг:\nh_i",
                          "Делений шага:\nC1",
                          "Удвоений шага:\nC2",
                          "Анал. решение",
                          "Норма разности \nс анал. реш"],

    "rigid_syst_data_s": ["Номер итерации:\ni",
                              "Координата:\nX_i",
                              "Числ. решение:\nV'_i",
                              "Числ. решение двойным шагом:\nv'_2i",
                              "Разность:\nV'_i-V'_2i",
                              "Оценка лок погр\n(общая норма):\nОЛП",
                              "Шаг:\nh_i",
                              "Делений шага:\nC1",
                              "Удвоений шага\nC2",
                              "Анал. решение",
                              "Норма разности \nс анал. реш"],

    "rigid_syst_data_const_step_w": ["Номер итерации:\ni",
                                     "Координата:\nX_i",
                                     "Числ. решение:\nV_i",
                                     "Шаг:\nh_i",
                                     "Делений шага:\nC1",
                                     "Удвоений шага\nC2",
                                     "Анал. решение",
                                     "Норма разности \nс анал. реш"],

    "rigid_syst_data_const_step_s": ["Номер итерации:\ni",
                                         "Координата:\nX_i",
                                         "Числ. решение:\nV'_i",
                                         "Шаг:\nh_i",
                                         "Делений шага:\nC1",
                                         "Удвоений шага\nC2",
                                         "Анал. решение",
                                         "Норма разности \nс анал. реш"],

    # вписать названия колонок
}
extra_info_rows = {
    "rigid_syst": [
        "Кол-во итераций n:",
        "Расст. до границы b-x_n:",
        "max|ОЛП|:",
        "Общее кол-во удвоений:",
        "Общее кол-во делений:",
        "max h_i:",
        "При x=",
        "min h_i:",
        "При x=",
        "max норма разницы с анал. реш"
    ],
    "rigid_syst_const_step": [
        "Кол-во итераций n:",
        "Расст. до границы b-x_n:",
        "Общее кол-во удвоений:",
        "Общее кол-во делений:",
        "max h_i:",
        "При x=",
        "min h_i:",
        "При x=",
        "max норма разницы с анал. реш"
    ]
}
