columns = {
    "rigid_syst_data_w": ["Номер итерации:\ni",
                          "Координата:\nX_i",
                          "Числ. решение:\nV1_i",
                          "Числ. решение двойным шагом:\nṼ1_i",
                          "Разность:\nV1_i-Ṽ1_i",
                          "Оценка модуля лок погр\n(общая норма)\n 2^p * ||S||:\n",
                          "Шаг:\nh_i",
                          "Делений шага:\nC1",
                          "Удвоений шага:\nC2",
                          "Анал. решение U1_i",
                          "Норма разности \nс анал. реш ||U_i-V_i||"],

    "rigid_syst_data_s": ["Номер итерации:\ni",
                              "Координата:\nX_i",
                              "Числ. решение:\nV2_i",
                              "Числ. решение двойным шагом:\nṼ2_i",
                              "Разность:\nV2_i-Ṽ2_i",
                              "Оценка модуля лок погр\n(общая норма)\n 2^p * ||S||:\n",
                              "Шаг:\nh_i",
                              "Делений шага:\nC1",
                              "Удвоений шага\nC2",
                              "Анал. решение U2_i",
                              "Норма разности \nс анал. реш ||U_i-V_i||"],

    "rigid_syst_data_const_step_w": ["Номер итерации:\ni",
                                     "Координата:\nX_i",
                                     "Числ. решение:\nV1_i",
                                     "Шаг:\nh_i",
                                     "Делений шага:\nC1",
                                     "Удвоений шага\nC2",
                                     "Анал. решение",
                                     "Норма разности \nс анал. реш ||U_i-V_i||"],

    "rigid_syst_data_const_step_s": ["Номер итерации:\ni",
                                         "Координата:\nX_i",
                                         "Числ. решение:\nV2_i",
                                         "Шаг:\nh_i",
                                         "Делений шага:\nC1",
                                         "Удвоений шага\nC2",
                                         "Анал. решение",
                                         "Норма разности \nс анал. реш ||U_i-V_i||"],

    # вписать названия колонок
}
extra_info_rows = {
    "rigid_syst": [
        "Кол-во итераций n:",
        "Расст. до границы b-x_n:",
        "max 2^p * ||S||:",
        "Общее кол-во удвоений:",
        "Общее кол-во делений:",
        "max h_i:",
        "При x=",
        "min h_i:",
        "При x=",
        "макс. норма разницы с анал. реш. ||U_i-V_i||"
    ],
    "rigid_syst_const_step": [
        "Кол-во итераций n:",
        "Расст. до границы b-x_n:",
        "Общее кол-во удвоений:",
        "Общее кол-во делений:",
        "max h_i:",
        "При x=",
        "min h_i:",
        "При x=",
        "max норма разницы с анал. реш ||U_i-V_i||"
    ]
}
